InformationRegisters/АнтропометрияФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АнтропометрияФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Рост</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РостДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерОдежды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерОбуви</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерГоловногоУбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерПротивогаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерРеспиратора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерПерчаток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерРукавиц</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеРазмеров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаВводаИзмерений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АнтропометрияФизическихЛиц/Forms/ФормаЗаписи/Ext/Form/Module.bsl
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ФизическоеЛицо") И ЗначениеЗаполнено(Параметры.ФизическоеЛицо) Тогда
		ФизическоеЛицо = Параметры.ФизическоеЛицо;
		ЗаписьПоФизическомуЛицу = РегистрыСведений.АнтропометрияФизическихЛиц.СоздатьМенеджерЗаписи();
		ЗаписьПоФизическомуЛицу.ФизическоеЛицо = ФизическоеЛицо;
		ЗаписьПоФизическомуЛицу.Прочитать();
		
		Если ЗначениеЗаполнено(ЗаписьПоФизическомуЛицу.ФизическоеЛицо) Тогда
			ЗначениеВДанныеФормы(ЗаписьПоФизическомуЛицу, Запись);
		Иначе
			Запись.ФизическоеЛицо = ФизическоеЛицо;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.ФизическоеЛицо) Тогда 
		ТекстСообщения =
			НСтр("ru = 'Поле Физическое лицо не заполнено. Ввод антропометрии возможен только в контексте физического лица.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	ЗначенияДляЗаполнения = Новый Структура();
	ЗначенияДляЗаполнения.Вставить("Ответственный", "Запись.Ответственный");
	ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
	
	Если Не ЗначениеЗаполнено(Запись.ДатаВводаИзмерений) Тогда
		Запись.ДатаВводаИзмерений = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.ФизическоеЛицо, "Наименование, Пол");
	СклонениеФИО = "";
	ФизическиеЛицаЗарплатаКадры.Просклонять(
		ЗначенияРеквизитов.Наименование, 2, СклонениеФИО, ЗначенияРеквизитов.Пол, Запись.ФизическоеЛицо);
	ФамилияИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СклонениеФИО);
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Антропометрия %1'"), ФамилияИнициалы);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Модифицированность И Не ДатаРедактироваласьВручную Тогда
		ТекущийОбъект.ДатаВводаИзмерений = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийОбъект.РостДо) И ТекущийОбъект.РостДо < ТекущийОбъект.Рост Тогда
		ТекстСообщения = НСтр("ru = 'Верхнее значение диапазона роста не может быть меньше нижнего значения'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Запись.РостДо", , Отказ);
		Возврат;
	КонецЕсли;
	
	ПредставлениеРоста = "";
	ПредставлениеРазмеров = "";
	Если ЗначениеЗаполнено(ТекущийОбъект.Рост) И ЗначениеЗаполнено(ТекущийОбъект.РостДо) Тогда
		ПредставлениеРоста = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Рост: от %1 до %2 см,'"), Строка(ТекущийОбъект.Рост), Строка(ТекущийОбъект.РостДо));
	ИначеЕсли ЗначениеЗаполнено(ТекущийОбъект.Рост) Тогда
		ПредставлениеРоста = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Рост: от %1 см,'"), Строка(ТекущийОбъект.Рост));
	ИначеЕсли ЗначениеЗаполнено(ТекущийОбъект.РостДо) Тогда
		ПредставлениеРоста = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Рост: до %1 см,'"), Строка(ТекущийОбъект.РостДо));
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущийОбъект.РазмерОдежды) Тогда
		ПредставлениеРазмеров = ПредставлениеРазмеров + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'одежды %1,'"), Строка(ТекущийОбъект.РазмерОдежды));
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущийОбъект.РазмерОбуви) Тогда
		ПредставлениеРазмеров = ПредставлениеРазмеров + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'обуви %1,'"), Строка(ТекущийОбъект.РазмерОбуви));
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущийОбъект.РазмерГоловногоУбора) Тогда
		ПредставлениеРазмеров = ПредставлениеРазмеров + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'головного убора %1,'"), Строка(ТекущийОбъект.РазмерГоловногоУбора));
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущийОбъект.РазмерПротивогаза) Тогда
		ПредставлениеРазмеров = ПредставлениеРазмеров + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'противогаза %1,'"), Строка(ТекущийОбъект.РазмерПротивогаза));
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущийОбъект.РазмерРеспиратора) Тогда
		ПредставлениеРазмеров = ПредставлениеРазмеров + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'респиратора %1,'"), Строка(ТекущийОбъект.РазмерРеспиратора));
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущийОбъект.РазмерПерчаток) Тогда
		ПредставлениеРазмеров = ПредставлениеРазмеров + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'перчаток %1,'"), Строка(ТекущийОбъект.РазмерПерчаток));
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущийОбъект.РазмерРукавиц) Тогда
		ПредставлениеРазмеров = ПредставлениеРазмеров + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'рукавиц %1,'"), Строка(ТекущийОбъект.РазмерРукавиц));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПредставлениеРоста) И ЗначениеЗаполнено(ПредставлениеРазмеров) Тогда
		ПредставлениеРазмеров = Лев(ПредставлениеРазмеров, СтрДлина(ПредставлениеРазмеров) - 1);
		ТекущийОбъект.ПредставлениеРазмеров = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 Размеры: %2'"), ПредставлениеРоста, ПредставлениеРазмеров);
	ИначеЕсли ЗначениеЗаполнено(ПредставлениеРоста) Тогда
		ПредставлениеРоста = Лев(ПредставлениеРоста, СтрДлина(ПредставлениеРоста) - 1);
		ТекущийОбъект.ПредставлениеРазмеров = ПредставлениеРоста;
	ИначеЕсли ЗначениеЗаполнено(ПредставлениеРазмеров) Тогда
		ПредставлениеРазмеров = Лев(ПредставлениеРазмеров, СтрДлина(ПредставлениеРазмеров) - 1);
		ТекущийОбъект.ПредставлениеРазмеров = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Размеры: %1'"), ПредставлениеРазмеров);
	Иначе
		ТекущийОбъект.ПредставлениеРазмеров =
			РегистрыСведений.АнтропометрияФизическихЛиц.ПредставлениеНезаполненныхРазмеров();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеАнтропометрииФизическогоЛица",, Запись.ФизическоеЛицо);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗаписьУдалена(Запись.ФизическоеЛицо) Тогда 
		Оповестить("ИзменениеАнтропометрииФизическогоЛица",, Запись.ФизическоеЛицо);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаВводаИзмеренийПриИзменении(Элемент)
	ДатаРедактироваласьВручную = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЗаписьУдалена(ФизическоеЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	АнтропометрияФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.АнтропометрияФизическихЛиц КАК АнтропометрияФизическихЛиц
		|ГДЕ
		|	АнтропометрияФизическихЛиц.ФизическоеЛицо = &ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	Возврат Запрос.Выполнить().Выбрать().Количество() = 0;
	
КонецФункции	

#КонецОбласти
